In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

In [2]:
database = 'ipldatabase.sqlite'

In [3]:
conn = sqlite3.connect(database)
cursor = conn.cursor()

tables = pd.read_sql (""" SELECT name FROM sqlite_master
                          WHERE type = 'table'; """, conn)

In [4]:
tables

               name
0            Player
1        Extra_Runs
2    Batsman_Scored
3     Batting_Style
4     Bowling_Style
5           Country
6            Season
7              City
8           Outcome
9            Win_By
10     Wicket_Taken
11            Venue
12       Extra_Type
13         Out_Type
14    Toss_Decision
15           Umpire
16             Team
17     Ball_by_Ball
18      sysdiagrams
19  sqlite_sequence
20            Match
21            Rolee
22     Player_Match

In [5]:
player = pd.read_sql(""" SELECT * FROM Player
                        ; """, conn)

In [6]:
player

,Player_Id,Player_Name,DOB,Batting_hand,Bowling_skill,Country_Name
0,1,SC Ganguly,1972-07-08 00:00:00,1,1.0,1
1,2,BB McCullum,1981-09-27 00:00:00,2,1.0,4
2,3,RT Ponting,1974-12-19 00:00:00,2,1.0,5
3,4,DJ Hussey,1977-07-15 00:00:00,2,2.0,5
4,5,Mohammad Hafeez,1980-10-17 00:00:00,2,2.0,6
...,...,...,...,...,...,...
464,465,DL Chahar,1992-08-07 00:00:00,2,1.0,1
465,466,P Dharmani,1974-09-27 00:00:00,2,NaN,1
466,467,RV Pawar,1979-09-06 00:00:00,1,7.0,1
467,468,KH Devdhar,1989-12-14 00:00:00,2,NaN,1
468,469,T Mishra,1986-12-22 00:00:00,2,3.0,1

In [13]:
player_age = pd.read_sql("""SELECT Player_Name, DOB
                            FROM Player
                            ORDER BY DOB;""", conn)
player_age

           Player_Name                  DOB
0        ST Jayasuriya  1969-06-30 00:00:00
1             SK Warne  1969-09-13 00:00:00
2           DS Lehmann  1970-02-05 00:00:00
3           GD McGrath  1970-02-09 00:00:00
4             SB Joshi  1970-06-06 00:00:00
..                 ...                  ...
464  Mustafizur Rahman  1995-09-06 00:00:00
465          S Kaushik  1995-09-07 00:00:00
466            RR Pant  1997-10-04 00:00:00
467            SN Khan  1997-10-27 00:00:00
468       Ishan Kishan  1998-07-18 00:00:00

[469 rows x 2 columns]

In [7]:
country = pd.read_sql ("""SELECT * FROM country;""",conn)
country

    Country_Id  Country_Name
0            1         India
1            2  South Africa
2            3         U.A.E
3            4   New Zealand
4            5     Australia
5            6      Pakistan
6            7     Sri Lanka
7            8   West Indies
8            9     Zimbabwea
9           10       England
10          11    Bangladesh
11          12   Netherlands

In [9]:
pd.read_sql("""SELECT * 
               FROM Player
               INNER JOIN Country
               ON Player.Country_Name = Country.Country_Id;""", conn)

,Player_Id,Player_Name,DOB,Batting_hand,Bowling_skill,Country_Name,Country_Id,Country_Name
0,1,SC Ganguly,1972-07-08 00:00:00,1,1.0,1,1,India
1,2,BB McCullum,1981-09-27 00:00:00,2,1.0,4,4,New Zealand
2,3,RT Ponting,1974-12-19 00:00:00,2,1.0,5,5,Australia
3,4,DJ Hussey,1977-07-15 00:00:00,2,2.0,5,5,Australia
4,5,Mohammad Hafeez,1980-10-17 00:00:00,2,2.0,6,6,Pakistan
...,...,...,...,...,...,...,...,...
464,465,DL Chahar,1992-08-07 00:00:00,2,1.0,1,1,India
465,466,P Dharmani,1974-09-27 00:00:00,2,NaN,1,1,India
466,467,RV Pawar,1979-09-06 00:00:00,1,7.0,1,1,India
467,468,KH Devdhar,1989-12-14 00:00:00,2,NaN,1,1,India
468,469,T Mishra,1986-12-22 00:00:00,2,3.0,1,1,India

In [12]:
player_country = pd.read_sql("""SELECT Player_Name, country.Country_Name
               FROM Player
               INNER JOIN Country
               ON Player.Country_Name = Country.Country_Id;""", conn)
player_country

         Player_Name Country_Name
0         SC Ganguly        India
1        BB McCullum  New Zealand
2         RT Ponting    Australia
3          DJ Hussey    Australia
4    Mohammad Hafeez     Pakistan
..               ...          ...
464        DL Chahar        India
465       P Dharmani        India
466         RV Pawar        India
467       KH Devdhar        India
468         T Mishra        India

[469 rows x 2 columns]